Join in Postgres, Add api in Jupyter, Export back to Postgres

For Orlando-Seattle Set: separate into morn, day, night in SQL,
drop useless columns and join on night in Jupyter, get back into Postgres.

For Atlanta, Baltimore, Chicago, Portland: Get the datasets into Postgres,
load them into Jupyter, use API to get city based on coordinates as a proof
of concept (using the top 25 of each), get back into Postgres.

.......And that is it?

In [1]:
from sqlalchemy import Table, MetaData, create_engine, select
import pandas as pd
import numpy as np

import requests
import json

#from config import gkey
from config import api_key

In [96]:
#Test out the google API
Test_df=Crime_df.head(20)
str(Test_df["Atlanta Latitude"][0]), str(Test_df["Atlanta Longitude"][0])

('33.74989', '-84.42897')

In [122]:
# This will be used to add the city using the lat/long from the
# combined Seattle and Orlando data sets.

base_url = "https://maps.googleapis.com/maps/api/geocode/json"
params = {
    "latlng": "33.74989, -84.42897",
    "key": api_key
}

response = requests.get(base_url, params)

City_return = response.json()
City=(City_return["results"][0]["address_components"][3]["long_name"])
print(City)
#print(json.dumps(City_return, indent=4, sort_keys=True))

Atlanta

In [4]:
# Start here

engine=create_engine("postgresql://postgres:postgres@localhost/ETL Project")
with engine.connect() as conn:
    conn.execute("SET search_path TO 'etl'")
    conn.execute("SET search_path TO 'etl'").keys()
    meta=MetaData()
    OS_table=Table("Orlando_Seattle_Crimes", meta, autoload=True, autoload_with=conn)
    OS_data=conn.execute(select([OS_table])).fetchall()
    col=OS_table.c

In [6]:
OS_df=pd.DataFrame(OS_data, columns=(  \
    'Crime Date', 'Orlando Crime', 'Orlando Crime Time', 'Seattle Crime', 'Seattle Crime Time'))

OS_df.head()

,Crime Date,Orlando Crime,Orlando Crime Time,Seattle Crime,Seattle Crime Time
0,2017-01-03,THEFT-BUILDING,Morning,All other larceny,Daytime
1,2017-01-03,THEFT-CARPROWL,Morning,All other larceny,Daytime
2,2017-01-03,THEFT-CARPROWL,Daytime,All other larceny,Daytime
3,2017-01-03,THEFT-OTH,Daytime,All other larceny,Daytime
4,2017-01-03,THEFT-CARPROWL,Daytime,All other larceny,Daytime

In [21]:
Orlando_df=OS_df[["Crime Date", "Orlando Crime", "Orlando Crime Time"]]
Orlando_df=Orlando_df.drop_duplicates()
Seattle_df=OS_df[["Crime Date", "Seattle Crime", "Seattle Crime Time"]]
Seattle_df=Seattle_df.drop_duplicates()

In [22]:
Orlando_df=Orlando_df.loc[Orlando_df["Orlando Crime Time"]=="Night",:]
Orlando_df.head()

       Crime Date         Orlando Crime Orlando Crime Time
0      2017-01-03        THEFT-CARPROWL              Night
7980   2017-01-03  BURGLARY-NOFORCE-RES              Night
9576   2017-01-03            THEFT-MAIL              Night
12768  2017-01-03      NARC-SELL-MARIJU              Night
14364  2017-01-03              TRESPASS              Night

In [23]:
Seattle_df=Seattle_df.loc[Seattle_df["Seattle Crime Time"]=="Night",:]
Seattle_df.head()

,Crime Date,Seattle Crime,Seattle Crime Time
0,2017-01-03,Simple assault,Night
114,2017-01-03,Drugs/narcotics,Night
456,2017-01-03,Theft from motor vehicle except parts/accessories,Night
684,2017-01-03,Burglary/breaking and entering,Night
1482,2017-01-03,Motor vehicle theft,Night

In [25]:
OS_df=pd.merge(Orlando_df, Seattle_df, on="Crime Date")
OS_df.count()

Crime Date            694
Orlando Crime         694
Orlando Crime Time    694
Seattle Crime         694
Seattle Crime Time    694
dtype: int64

In [26]:
# Get dataframe back into Postgres.

engine=create_engine("postgresql://postgres:postgres@localhost/ETL Project")

OS_df.to_sql(name="OS_data", con=engine, schema="etl", if_exists="append", index=False)

In [27]:
# Query to make sure table was created
# Read_sql_table is used to call the specific schema

pd.read_sql_table('OS_data', con=engine, schema="etl").head()

,Crime Date,Orlando Crime,Orlando Crime Time,Seattle Crime,Seattle Crime Time
0,2017-01-03,THEFT-CARPROWL,Night,Simple assault,Night
1,2017-01-03,THEFT-CARPROWL,Night,Drugs/narcotics,Night
2,2017-01-03,THEFT-CARPROWL,Night,Theft from motor vehicle except parts/accessories,Night
3,2017-01-03,THEFT-CARPROWL,Night,Burglary/breaking and entering,Night
4,2017-01-03,THEFT-CARPROWL,Night,Motor vehicle theft,Night

In [28]:
# If this works, try using it for the other tables for API
# Atlanta, Baltimore, Chicago, Portland

Atlanta_df=pd.read_sql_table('Atlanta_Crimes', con=engine, schema="etl").head(25)
Baltimore_df=pd.read_sql_table("Baltimore_Crimes", con=engine, schema="etl").head(25)
Chicago_df=pd.read_sql_table("Chicago_Crimes", con=engine, schema="etl").head(25)
Portland_df=pd.read_sql_table("Portland_Crimes", con=engine, schema="etl").head(25)

In [29]:
Atlanta_df=Atlanta_df[["occur_date", "occur_time", "description", "latitude", "longitude"]]
Atlanta_df.head()

  occur_date occur_time           description  latitude  longitude
0 2017-12-30   23:15:00  LARCENY-FROM VEHICLE  33.75582  -84.38013
1 2017-12-18   13:00:00  LARCENY-FROM VEHICLE  33.78674  -84.39745
2 2017-12-30   22:01:00  LARCENY-FROM VEHICLE  33.73760  -84.39486
3 2017-12-30   20:00:00  LARCENY-FROM VEHICLE  33.75156  -84.39887
4 2017-12-31   00:41:00  LARCENY-FROM VEHICLE  33.72146  -84.46522

In [30]:
Baltimore_df=Baltimore_df[["occur_date", "time", "description", "latitude", "longitude", "coordinates"]]
Baltimore_df=Baltimore_df.rename(columns={"time": "occur_time"})
Baltimore_df.head()

,occur_date,occur_time,description,latitude,longitude,coordinates
0,2017-09-02,23:30:00,ROBBERY - RESIDENCE,39.22951,-76.60541,"(39.2295100000, -76.6054100000)"
1,2017-09-02,23:00:00,AUTO THEFT,39.31360,-76.63217,"(39.3136000000, -76.6321700000)"
2,2017-09-02,22:53:00,SHOOTING,39.34768,-76.60697,"(39.3476800000, -76.6069700000)"
3,2017-09-02,22:50:00,AGG. ASSAULT,39.28315,-76.64526,"(39.2831500000, -76.6452600000)"
4,2017-09-02,22:31:00,COMMON ASSAULT,39.28756,-76.61365,"(39.2875600000, -76.6136500000)"

In [36]:
# Fix the date variable in Postgres:  12/4/2014 9:30
Chicago_df.head()

,number,id,case_number,occur_date,block,iucr,type,description,location_type,arrest,...,ward,area,fbi_code,x_coord,y_coord,year,updated,latitude,longitude,location
0,4506608.0,9878952.0,HX529642,2014-12-04,010XX E 47TH ST,497,BATTERY,AGGRAVATED DOMESTIC BATTERY: OTHER DANG WEAPON,APARTMENT,FALSE,...,4.0,39.0,04B,1183896.0,1874058.0,2014.0,2016-02-04,41.809597,-87.601016,"(41.809597, -87.601016)"
1,561379.0,2514319.0,HH857213,2002-12-24,055XX W CONGRESS PKWY,1320,CRIMINAL DAMAGE,TO VEHICLE,OTHER,FALSE,...,29.0,25.0,14,1139530.0,1897135.0,2002.0,2016-04-15,41.873845,-87.763183,"(41.873845, -87.763183)"
2,5058884.0,3891396.0,HL266026,2005-03-31,050XX N KIMBALL AVE,141C,WEAPONS VIOLATION,UNLAWFUL USE OTHER DANG WEAPON,"SCHOOL, PUBLIC, GROUNDS",TRUE,...,39.0,13.0,15,1152801.0,1933422.0,2005.0,2016-04-15,41.973168,-87.713495,"(41.973168, -87.713495)"
3,3619502.0,4983700.0,HM446634,2006-06-30,034XX W CHICAGO AVE,2092,NARCOTICS,SOLICIT NARCOTICS ON PUBLICWAY,SIDEWALK,TRUE,...,27.0,23.0,26,1153483.0,1905125.0,2006.0,2016-04-15,41.895505,-87.711742,"(41.895505, -87.711742)"
4,5533749.0,5284225.0,HM654977,2006-10-11,007XX S CICERO AVE,1506,PROSTITUTION,SOLICIT ON PUBLIC WAY,STREET,TRUE,...,24.0,25.0,16,1144509.0,1896222.0,2006.0,2016-04-15,41.871248,-87.744926,"(41.871248, -87.744926)"

In [38]:
Portland_df=Portland_df[["occur_date", "occur_time", "latitude", "longitude"]]
Portland_df.head()

  occur_date  occur_time   latitude   longitude
0 2017-02-20         0.0  45.470545 -122.625298
1 2017-02-20        30.0  45.467028 -122.625272
2 2017-02-21      2345.0  45.471859 -122.630327
3 2017-02-21      2350.0  45.475196 -122.630444
4 2016-12-21      1330.0  45.534551 -122.671730